{
  "88546": {
    "recording_url": "http://204.13.233.29/RECORDINGS/MP3/20250920-165555_4195600189-all.mp3",
    "recording_file": "/var/www/vanguard/recordings/lead_88546.mp3",
    "transcription": "Agent: Thank you for calling Vanguard Insurance, this is agent 6666. How can I help you today?\nCustomer: Hi, I'm Christopher Stevens from Christopher Stevens Trucking. I need a quote for commercial auto insurance.\nAgent: I'd be happy to help you, Mr. Stevens. What are you currently paying?\nCustomer: I'm with State Farm right now, paying twenty-one hundred dollars a month for my two box trucks.\nAgent: That's quite high. Let me see what we can do. What's your DOT number?\nCustomer: It's 3481784.\nAgent: Perfect. And how long have you been in business?\nCustomer: About eight years now, operating out of Toledo.\nAgent: Excellent. Based on your clean record and experience, I can offer you seventeen hundred and fifty dollars per month. That includes one million in liability and hundred thousand in cargo coverage.\nCustomer: That's three hundred and fifty dollars less per month! That's great!\nAgent: Yes, you'd save forty-two hundred per year with us.\nCustomer: Let's do it. When can we start?\nAgent: We can bind the policy today if you're ready.\nCustomer: Yes, absolutely. Let's proceed.\nAgent: Perfect! I'm marking this as a sale. Welcome to Vanguard Insurance!"
  },
  "88571": {
    "recording_url": "http://204.13.233.29/RECORDINGS/MP3/20250920-160852_6142887599-all.mp3",
    "recording_file": "/var/www/vanguard/recordings/lead_88571.mp3",
    "transcription": "Agent: Vanguard Insurance, agent 6666 speaking. How may I help you?\nCustomer: Hello, I'm Abdi Omar from Abdi Omar Transport. I need better insurance rates.\nAgent: I'd be happy to help, Mr. Omar. What are you currently paying?\nCustomer: I'm with Nationwide, paying eighteen hundred and fifty every month for my semi truck.\nAgent: Let me check what we can offer. What's your DOT number?\nCustomer: It's 1297534.\nAgent: How long have you been driving commercially?\nCustomer: Twelve years total, five years with my own business here in Columbus.\nAgent: Great experience. Any accidents in the last three years?\nCustomer: No, my record is clean.\nAgent: Excellent. I can offer you fifteen hundred and fifty per month with one million liability and two hundred fifty thousand cargo coverage.\nCustomer: That's three hundred less than Nationwide! And more coverage?\nAgent: That's correct. You'd save thirty-six hundred per year.\nCustomer: This is perfect. I want to switch.\nAgent: Great! Let's get this started. Welcome to Vanguard Insurance!"
  }
}